In [7]:
%%cmd
dir ..\data\movielens

Microsoft Windows [Version 10.0.26100.2894]
(c) Microsoft Corporation. All rights reserved.

c:\Users\ljack\Desktop\maab uz ai\python-exercises\data_analysis_projects\practice-pandas\project-3>dir ..\data\movielens
 Volume in drive C has no label.
 Volume Serial Number is 08A6-4D02

 Directory of c:\Users\ljack\Desktop\maab uz ai\python-exercises\data_analysis_projects\practice-pandas\data\movielens

04/02/2025  11:15    <DIR>          .
04/02/2025  11:02    <DIR>          ..
04/02/2025  11:10           168,548 movies.csv
04/02/2025  11:10        22,593,746 ratings.csv

04/02/2025  11:15           115,623 users.csv
               3 File(s)     22,877,917 bytes
               2 Dir(s)  111,405,260,800 bytes free

c:\Users\ljack\Desktop\maab uz ai\python-exercises\data_analysis_projects\practice-pandas\project-3>

Imports

In [10]:
import pandas as pd

Data load

In [19]:
path = '../data/movielens/'
users = pd.read_csv(path + "users.csv", delimiter=";")
movies = pd.read_csv(path + "movies.csv", delimiter=";", encoding="ISO-8859-1")
ratings = pd.read_csv(path + "ratings.csv", delimiter=";")

Read the data

In [23]:
for df in [users, ratings, movies]:
    print(df.sample(6))
    print('=' * 50)

      userId gender  age  occupation zip-code
5365    5366      M   18          12    90045
1207    1208      M   25           0    12590
530      531      F   18          14    22206
5106    5107      F   45           0     8081
3839    3840      F   25           0     2176
3773    3774      M   25           0    52556
==================================================
        userId  movieId  rating  timestamp
937293    5654      377       3  960010437
619956    3756     1196       5  966096055
813267    4883     1198       5  962753402
518382    3199     2006       4  968631939
510717    3147      157       3  968965462
738198    4411     3180       2  969333350
==================================================
      movieId                                  title  \
2499     2568                  Mod Squad, The (1999)
2411     2480  Dry Cleaning (Nettoyage à sec) (1997)
1624     1670             Welcome To Sarajevo (1997)
1011     1024           Three Caballeros, The (1945)
510       514                        Ref, The (1994)
2486     2555                   Baby Geniuses (1999)

                            genres Unnamed: 3
2499                  Action|Crime        NaN
2411                         Drama        NaN
1624                     Drama|War        NaN
1011  Animation|Children's|Musical        NaN
510                         Comedy        NaN
2486                        Comedy        NaN
==================================================

Merge the data

In [24]:
# (users & ratings) & movies
data = pd.merge(pd.merge(users, ratings), movies)

In [32]:
data.drop('Unnamed: 3', axis=1, inplace=True)

In [34]:
data.head()

,userId,gender,age,occupation,zip-code,movieId,rating,timestamp,title,genres
0,1,F,1,10,48067,1193,5,978300760,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,M,56,16,70072,1193,5,978298413,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,M,25,12,32793,1193,4,978220179,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,M,25,7,22903,1193,4,978199279,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,M,50,1,95350,1193,5,978158471,One Flew Over the Cuckoo's Nest (1975),Drama

In [36]:
data.iloc[0]

userId                                             1
gender                                             F
age                                                1
occupation                                        10
zip-code                                       48067
movieId                                         1193
rating                                             5
timestamp                                  978300760
title         One Flew Over the Cuckoo's Nest (1975)
genres                                         Drama
Name: 0, dtype: object

Filter the data, size >= 250

In [39]:
mean_ratings = data.pivot_table('rating', index='title', columns='gender', aggfunc='mean')
mean_ratings.head()

gender                                F         M
title
$1,000,000 Duck (1971)         3.375000  2.761905
'Night Mother (1986)           3.388889  3.352941
'Til There Was You (1997)      2.675676  2.733333
'burbs, The (1989)             2.793478  2.962085
...And Justice for All (1979)  3.828571  3.689024

In [41]:
ratings_by_title = data.groupby('title').size()
ratings_by_title.head()

title
$1,000,000 Duck (1971)            37
'Night Mother (1986)              70
'Til There Was You (1997)         52
'burbs, The (1989)               303
...And Justice for All (1979)    199
dtype: int64

In [46]:
active_titles = ratings_by_title.index[ratings_by_title >= 250]
active_titles

Index([''burbs, The (1989)', '10 Things I Hate About You (1999)',
       '101 Dalmatians (1961)', '101 Dalmatians (1996)', '12 Angry Men (1957)',
       '13th Warrior, The (1999)', '2 Days in the Valley (1996)',
       '20,000 Leagues Under the Sea (1954)', '2001', '2010 (1984)',
       ...
       'X-Men (2000)', 'Year of Living Dangerously (1982)',
       'Yellow Submarine (1968)', 'You've Got Mail (1998)',
       'Young Frankenstein (1974)', 'Young Guns (1988)',
       'Young Guns II (1990)', 'Young Sherlock Holmes (1985)',
       'Zero Effect (1998)', 'eXistenZ (1999)'],
      dtype='object', name='title', length=1205)

In [47]:
mean_ratings = mean_ratings.loc[active_titles]
mean_ratings

gender                                    F         M
title
'burbs, The (1989)                 2.793478  2.962085
10 Things I Hate About You (1999)  3.646552  3.311966
101 Dalmatians (1961)              3.791444  3.500000
101 Dalmatians (1996)              3.240000  2.911215
12 Angry Men (1957)                4.184397  4.328421
...                                     ...       ...
Young Guns (1988)                  3.371795  3.425620
Young Guns II (1990)               2.934783  2.904025
Young Sherlock Holmes (1985)       3.514706  3.363344
Zero Effect (1998)                 3.864407  3.723140
eXistenZ (1999)                    3.098592  3.289086

[1205 rows x 2 columns]

Sort top movies or F and M

In [50]:
top_female_ratings = mean_ratings.sort_values(by='F', ascending=False)
top_female_ratings.head()

gender                                                F         M
title
Close Shave, A (1995)                          4.644444  4.473795
Wrong Trousers, The (1993)                     4.588235  4.478261
Sunset Blvd. (a.k.a. Sunset Boulevard) (1950)  4.572650  4.464589
Wallace & Gromit                               4.563107  4.385075
Schindler's List (1993)                        4.562602  4.491415

In [51]:
top_male_ratings = mean_ratings.sort_values(by='M', ascending=False)
top_male_ratings.head()

gender                                                     F         M
title
Godfather, The (1972)                               4.314700  4.583333
Seven Samurai (The Magnificent Seven) (Shichini...  4.481132  4.576628
Shawshank Redemption, The (1994)                    4.539075  4.560625
Raiders of the Lost Ark (1981)                      4.332168  4.520597
Usual Suspects, The (1995)                          4.513317  4.518248

In [56]:
#  disagreement between Females and Males
mean_ratings['diff'] = mean_ratings['F'] - mean_ratings['M']
sorted_by_diff = mean_ratings.sort_values(by='diff', ascending=False)
sorted_by_diff

gender                                         F         M      diff
title
Dirty Dancing (1987)                    3.790378  2.959596  0.830782
Jumpin' Jack Flash (1986)               3.254717  2.578358  0.676359
Grease (1978)                           3.975265  3.367041  0.608224
Little Women (1994)                     3.870588  3.321739  0.548849
Steel Magnolias (1989)                  3.901734  3.365957  0.535777
...                                          ...       ...       ...
Cable Guy, The (1996)                   2.250000  2.863787 -0.613787
Longest Day, The (1962)                 3.411765  4.031447 -0.619682
Dumb & Dumber (1994)                    2.697987  3.336595 -0.638608
Kentucky Fried Movie, The (1977)        2.878788  3.555147 -0.676359
Good, The Bad and The Ugly, The (1966)  3.494949  4.221300 -0.726351

[1205 rows x 3 columns]

In [59]:
# disagreement regardless gender
rating_std_by_title = data.groupby('title')['rating'].std()
rating_std_by_title = rating_std_by_title.loc[active_titles]
rating_std_by_title.sort_values(ascending=False).head()

title
Dumb & Dumber (1994)                     1.321333
Blair Witch Project, The (1999)          1.316368
Natural Born Killers (1994)              1.307198
Tank Girl (1995)                         1.277695
Rocky Horror Picture Show, The (1975)    1.260177
Name: rating, dtype: float64